; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_1 ?v2 - type_2 ?v1 - type_1)
 	      (pred_3 ?v4 - object ?v1 - type_1)
	      (pred_4 ?v2 - type_2 ?v8 - type_3)
	      (pred_2 ?v2 - type_2 ?v4 - object ?v8 - type_3))

   (:action op_1
       :parameters  (?v2 - type_2 ?v5 ?v6 - type_1)
       :precondition (and  (pred_1 ?v2 ?v5))
       :effect (and  (pred_1 ?v2 ?v6)
		     (not (pred_1 ?v2 ?v5))))

   (:action op_3
       :parameters (?v2 - type_2 ?v3 - object ?v7 - type_1 ?v8 - type_3)
       :precondition  (and  (pred_3 ?v3 ?v7) (pred_1 ?v2 ?v7) (pred_4 ?v2 ?v8))
       :effect (and (pred_2 ?v2 ?v3 ?v8)
		    (not (pred_3 ?v3 ?v7)) 
		    (not (pred_4 ?v2 ?v8))))

   (:action op_2
       :parameters (?v2 - type_2 ?v3 - object ?v7 - type_1 ?v8 - type_3)
       :precondition  (and  (pred_2 ?v2 ?v3 ?v8) (pred_1 ?v2 ?v7))
       :effect (and (pred_3 ?v3 ?v7)
		    (pred_4 ?v2 ?v8)
		    (not (pred_2 ?v2 ?v3 ?v8)))))

; problem
(define (problem gripper-2-3-2)
(:domain gripper-strips)
(:objects obj_05 obj_06 - type_2
obj_10 obj_04 obj_11 obj_07 - type_3
obj_09 obj_08 obj_02 - type_1
obj_01 obj_03 - object)
(:init
(pred_1 obj_05 obj_09)
(pred_4 obj_05 obj_10)
(pred_4 obj_05 obj_04)
(pred_1 obj_06 obj_02)
(pred_4 obj_06 obj_11)
(pred_4 obj_06 obj_07)
(pred_3 obj_01 obj_02)
(pred_3 obj_03 obj_02)
)
(:goal
(and
(pred_3 obj_01 obj_09)
(pred_3 obj_03 obj_08)
)
)

(:constraints
  (and
    (always (not (and (pred_1 obj_05 obj_09) (pred_1 obj_06 obj_09))))
  )
)
)

; plan
1. (op_3 obj_06 obj_01 obj_02 obj_07)
   deleted: (pred_3 obj_01 obj_02) (pred_4 obj_06 obj_07)
   added: (pred_2 obj_06 obj_01 obj_07)
   goals met: 0 of 2
2. (op_3 obj_06 obj_03 obj_02 obj_11)
   deleted: (pred_3 obj_03 obj_02) (pred_4 obj_06 obj_11)
   added: (pred_2 obj_06 obj_03 obj_11)
   goals met: 0 of 2
3. (op_1 obj_05 obj_09 obj_08)
   deleted: (pred_1 obj_05 obj_09)
   added: (pred_1 obj_05 obj_08)
   goals met: 0 of 2
4. (op_1 obj_06 obj_02 obj_08)
   deleted: (pred_1 obj_06 obj_02)
   added: (pred_1 obj_06 obj_08)
   goals met: 0 of 2
5. (op_2 obj_06 obj_03 obj_08 obj_11)
   deleted: (pred_2 obj_06 obj_03 obj_11)
   added: (pred_3 obj_03 obj_08) (pred_4 obj_06 obj_11)
   goals met: 1 of 2
6. (op_1 obj_06 obj_08 obj_09)
   deleted: (pred_1 obj_06 obj_08)
   added: (pred_1 obj_06 obj_09)
   goals met: 1 of 2
7. (op_2 obj_06 obj_01 obj_09 obj_07)
   deleted: (pred_2 obj_06 obj_01 obj_07)
   added: (pred_3 obj_01 obj_09) (pred_4 obj_06 obj_07)
   goals met: 2 of 2
